#include <stdio.h>

int main(void)
{
    //変数の宣言
    int s[]={125814,225547,132254,224321,352124,342214,382154,321014,112254,153789};//給与
    int c[]={0,0,0,0,0,0,0,0,0};//万、五千、千、五百、百、五十、十、五、一円の枚数
    int i;//繰り返し媒体

    //計算部分
    for(i=0;i<10;i++) {
        int A = s[i] / 10000;
        int B = s[i] / 5000;
        int C = s[i] / 1000;
        int D = s[i] / 500;
        int E = s[i] / 100;
        int F = s[i] / 50;
        int G = s[i] / 10;
        int H = s[i] / 5;
        int I = s[i] / 1;
        c[0]+=A;
        c[1]+=(s[i] - A * 10000)/5000;
        c[2]+=(s[i] - B * 5000)/1000;
        c[3]+=(s[i] - C * 1000)/500;
        c[4]+=(s[i] - D * 500)/100;
        c[5]+=(s[i] - E * 100)/50;
        c[6]+=(s[i] - F * 50)/10;
        c[7]+=(s[i] - G * 10)/5;
        c[8]+=(s[i] - H * 5)/1;
    }

    //出力部分
    printf("10000円 → %d枚\n",c[0]);
    printf("5000円 → %d枚\n",c[1]);
    printf("1000円 → %d枚\n",c[2]);
    printf("500円 → %d枚\n",c[3]);
    printf("100円 → %d枚\n",c[4]);
    printf("50円 → %d枚\n",c[5]);
    printf("10円 → %d枚\n",c[6]);
    printf("5円 → %d枚\n",c[7]);
    printf("1円 → %d枚\n",c[8]);

    return 0;//プログラム終了
}








/*1人ずつでループして、結果時に合計する。*/
